Repository: sujaygoswami/fortress6-sf
Catalog: task 27.08.2024/chnaged/Private/Language/*.locallang.xlf
Languages: th

# started_login
source: Security Check
th: การตรวจสอบความปลอดภัย

# started_date
source: Data
th: ข้อมูล

# started_correctly
source: correct?
th: ถูกต้อง?

# started_ready
source: Done
th: เสร็จสิ้น

# started_upload
source: Upload
th: อัปโหลด

# started_portrait
source: Portrait
th: การถ่ายภาพบุคคล

# started_info_about_you
source: Security Check
th: การตรวจสอบความปลอดภัย

# started_dob
source: Please Enter Your Date of Birth
th: โปรดใส่วันเกิด

# started_password
source: password
th: รหัสผ่าน

# started_further
source: FURTHER
th: ต่อไป

# started_image_login_disabled
source: We have already received an image.
th: เราได้รับรูปภาพแล้ว

# started_enter_password
source: Enter your password
th: กรุณาใส่รหัสผ่านของคุณ

# day_label
source: Day
th: วัน

# month_label
source: Month
th: เดือน

# year_label
source: Year
th: ปี

# error_password
source: This field is mandatory!
th: กรุณากรอกข้อมูลในช่องนี้

# school_confirm_error
source: Please read and accept the privacy policy
th: โปรดอ่านนโยบายความเป็นส่วนตัว & ยอมรับ

# error_year
source: Enter year
th: กรุณาใส่ปีเกิด

# error_month
source: Enter month
th: กรุณาใส่เดือน

# error_day
source: Enter day
th: กรุณาใส่วัน

source: Information about you
th: ข้อมูลของคุณ

# schulname
source: School name
th: ชื่อโรงเรียน

# klasse
source: Class
th: ชั้นเรียน

# click_select
source: Click and select
th: คลิกและเลือก"

# vorname
source: First Name
th: ชื่อ

# pls_first_name
source: Please enter your first name and middle (if have middle name)
th: กรุณาใส่ชื่อของคุณ และชื่อกลาง(ถ้ามี)

# surname
source: Last Name(s)
th: นามสกุล

# pls_surname
source: Please enter all last names.
th: โปรดกรอกนามสกุล(หรือนามสกุลทั้งหลาย)

# received_an_image
source: We have already received an image.
th: เราได้รับรูปภาพแล้ว

# kundennummer
source: Customer ID
th: หมายเลขลูกค้า

source: Required fields
th: ช่องที่ต้องระบุ

source: Date of Birth
th: วันเกิด

source: Email
th: อีเมล

# notes
source: School Portraits (Thailand) Co., Ltd. uses the email address you provide here solely for the purpose of creating your student ID. You can, of course, object to this use at any time.
th: บริษัท School Portraits (Thailand) Co., Ltd. จะใช้ที่อยู่อีเมลที่ท่านให้ไว้เพื่อสร้างบัตรนักเรียนของท่านเท่านั้น ท่านสามารถปฏิเสธการให้ข้อมูลนี้ได้ตลอดเวลา

# korrekturen
source: Corrections
th: แก้ไข

# correction_text
source: Please enter corrections here. If none are needed, please leave this field blank.
th: กรุณาป้อนการแก้ไขที่เป็นไปได้ที่นี่ หากไม่มีการแก้ไข โปรดปล่อยให้ช่องนี้ว่าง

# photo_note
source: Please do not use inappropriate ID photos as shown here.
th: กรุณาอย่าใช้รูปบัตรประชาชนที่ไม่เหมาะสม เช่น ที่แสดงไว้ที่นี้

# photo_under
source: UNDERSTOOD
th: รับทราบ

# photo_good_note
source: This is an example of a good portrait. You can upload an existing one or take a selfie with your smartphone.
th: นี้คือตัวอย่างภาพถ่ายที่ดี คุณสามารถอัปโหลดรูปที่มีอยู่แล้วหรือถ่ายรูปเซลฟีด้วยสมาร์ทโฟนของคุณ

# accepted_formats
source: Accepted file formats
th: ไฟล์ที่ยอมรับ

source: Maximum file size
th: ขนาดไฟล์สูงสุด

# take_a_selfeie
source: TAKE A SELFIE NOW
th: ถ่ายรูปเซลฟี

source: UPLOAD A PORTRAIT
th: อัปโหลดภาพถ่าย

# upload_Save
source: Save
th: "บันทึก

# no_portrait_photo
source: No portrait photo at hand?
th: คุณไม่มีรูปถ่ายใบหน้าในขณะนี้ใช่ไหม?

# nofound1
source: No record found
th: ไม่พบข้อมูล

# nofound2
source: Did you choose the right class?
th: คุณได้เลือกชั้นเรียนที่ถูกต้องหรือไม่?

# nofound3
source: Have you entered all of your first names?
th: คุณได้กรอกชื่อจริงทั้งหมดหรือไม่?

# nofound4
source: Have you entered all last names?
th: คุณได้กรอกนามสกุลทั้งหมดหรือยัง?

# confirm_email
source: Please confirm your email
th: โปรดยืนยันอีเมลของคุณ

# confirm_email_text1
source: Please check your emails and confirm them.
th: โปรดตรวจสอบอีเมลของคุณและยืนยัน

# confirm_email_text2
source: OnlOnly then can you upload your photo for the student ID.
th: หลังจากนั้นคุณสามารถอัปโหลดรูปภาพสำหรับบัตรนักเรียนได้

# confirm_email_text3
source: If the email is not in your main inbox, please check the spam folder.
th: ถ้าคุณไม่พบอีเมลในกล่องขาเข้า กรุณาตรวจสอบในโฟลเดอร์สแปมด้วย

# email_already_confirmed
source: Your email has already been confirmed.
th: ท่านได้ทำการยืนยันอีเมล

# filter_review_your_details
source: Review your details
th: คุณตรวจสอบข้อมูลของคุณถูกต้องหรือไม่?

# accept_term_1
source: I have read and accepted the
th: ฉันได้อ่านและยอมรับ

# accept_term_2
source: privacy policy
th: นโยบายความเป็นส่วนตัว

# accept_term_3
source: and
th: และ

# accept_term_4
source: data protection
th: นโยบายความเป็นส่วนตัว

# accept_term_5
source: regulations.
th: อ่านและยอมรับ

# thankyou_save_digital
source: Save your digital student ID now!
th: บันทึกบัตรนักเรียนดิจิทัลตอนนี้!

# thankyou_importpicture
source: Your This ID picture will be used shortly. Once submitted, you won't be able to change it. If you want to change it, click on 'Back'.
th: รูปบัตรนี้จะถูกใช้ในไม่ช้านี้ หลังจากที่คุณได้ทำการส่ง คุณจะไม่สามารถแก้ไขได้อีก หากคุณต้องการแก้ไข โปรดคลิก 'ย้อนกลับ.

# thankyou_back
source: Back
th: ย้อนกลับ

# uploading_images_error
source: Something went wrong while uploading images.
th: การอัปโหลดรูปภาพผิดพลาดบางอย่าง

# uploading_thank_you_successfully
source: Thank you - your data has been successfully transmitted.
th: ขอบคุณมากครับ/ค่ะ - ข้อมูลของคุณถูกส่งเรียบร้อยแล้ว

# uploading_thank_uploaded_image
source: Your uploaded image
th: ภาพที่คุณอัปโหลด

# uploading_thank_image_change1
source: If you want to change the image, please click Back.
th: ถ้าคุณต้องการเปลี่ยนรูปภาพ โปรดคลิก 'ย้อนกลับ'

# uploading_thank_image_change2
source: We produce the student ID card i.d. Usually between 5-7 working days. You will then receive this from the school.
th: เราจะทำบัตรนักเรียนภายใน 5-7 วันทำการ และคุณจะได้รับบัตรนักเรียนผ่านทางโรงเรียน

# uploading_thank_image_change3
source: You can now close the application.
th: คุณสามารถปิดแอปพลิเคชันได้เดี๋ยวนี้

# uploading_thank_image_change4
source: Something went wrong while uploading images.
th: ถ้าคุณต้องการเปลี่ยนรูปภาพ กรุณาคลิก 'ย้อนกลับ'

# click_add_apple_wallet
source: Click "Add to Apple Wallet."
th: คลิกที่ "เพิ่มลงใน Apple Wallet"

# for_ios
source: Add to Apple Wallet
th: สำหรับ iOS:

# for_ios_1
source: Click on 'Add to Apple Wallet,' then a preview will be shown. The digital student ID will only be saved when you click 'Add' at the top right corner of the preview.
th: คลิกที่ 'เพิ่มลงใน Apple Wallet' จากนั้นจะปรากฏหน้าต่างตัวอย่าง บัตรนักเรียนดิจิทัลจะถูกบันทึกเมื่อคุณคลิกที่ 'เพิ่ม' ที่มุมบนขวาของหน้าต่างตัวอย่าง

source: For Android
th: สำหรับ Android:

# for_android_1
source: Please download the Google Wallet app from the Google Play Store if it is not yet installed on your device.
th: กรุณาดาวน์โหลดแอป Google Wallet จาก Google Play Store ในกรณีที่ยังไม่ได้ติดตั้งในอุปกรณ์ของท่าน

# for_android_5
source: Google Wallet app
th: แอป Google Wallet

# for_android_2
source: offers the best user experience. Google Wallet cards are stored on servers and synchronized across users' Google accounts on all devices where the Google Wallet app is installed. Alternatively, you can also use the
th: bietet die beste Nutzererfahrung. Google Wallet-Karten werden auf Servern gespeichert und über das Google-Konto der Benutzer auf allen Geräten synchronisiert, auf denen die Google Wallet App installiert ist. Als Alternative zur Google Wallet App können Sie auch die

# for_android_7
source: , although we cannot automatically update student IDs here. However, you can trigger an update manually.
th: verwenden (Beachten Sie jedoch, dass wir die Schülerausweise hier nicht automatisch aktualisieren können. Sie können jedoch eine Aktualisierung manuell initiieren.)

# for_android_3
source: You have also received the new digital student ID in your email.
th: We have also sent you the new digital student ID via email.

# for_open_map
source: Open the student ID.
th: เปิดใช้งานบัตรนักเรียน

# for_open_map1
source: After opening the map, a preview of the map will be displayed. Only by clicking on â€œAdd to Walletâ€ will the card be saved in the wallet app.
th: หลังจากเปิดใช้งานบัตรนักเรียน จะปรากฏหน้าต่างตัวอย่าง คลิก "เพิ่มลงใน Wallet" จะทำการบันทึกลงในแอป Wallet

# for_open_map2
source: Check the wallet app on your smartphone. Whenever the wallet app is opened, the new digital student ID card can be displayed. The back of the student ID card can be opened by clicking on the three dots.
th: ตรวจสอบแอป Wallet ในโทรศัพท์ของคุณ ทุกครั้งที่เปิดแอป Wallet บัตรนักเรียนดิจิทัลสามารถแสดงได้ ส่วนหลังของบัตรนักเรียนสามารถเปิดได้โดยการคลิกที่สามจุด

# for_open_map3
source: At the same time, you have also received the new digital student ID card sent to your email.
th: ในเวลาเดียวกัน คุณจะได้รับบัตรนักเรียนดิจิทัลใหม่ทางอีเมล

# ex_download_limit
source: You have exceeded your download limit for this ID. If you wish to install the pass on a new device, please contact support.
th: คุณได้เกินขีดจำกัดการดาวน์โหลดสำหรับบัตรนี้แล้ว หากคุณต้องการติดตั้งบัตรนี้ในอุปกรณ์ใหม่ โปรดติดต่อฝ่ายสนับสนุน

# click_qr_code
source: Click to scan QR-Code
th: คลิกเพื่อสแกน QR-Code

# wallet_language
source: Your wallet app now displays the student ID card in the new language.
th: แอปพลิเคชันของคุณในกระเป๋าเงินตอนนี้แสดงบัตรนักเรียนในภาษาใหม่

source: Change language
th: เปลี่ยนภาษา

# profile_student_issued
source: This student ID is issued for
th: บัตรนักเรียนนี้ถูกออกให้สำหรับ

# profile_photo
source: Photo / ภาพถ่าย
th: Photo / ภาพถ่ายo

# profile_geburtsdatum
source: Date of Birth
th: วันเกิด

# profile_tag
source: Day
th: วัน

# profile_monat
source: Month
th: เดือน

# profile_jahr
source: Year
th: ปี

# profile_weiter
source: Next
th: ต่อไป

# profile_lang_refresh
source: Language settings can only be changed after an ID refresh
th: การตั้งค่าภาษาสามารถทำได้เท่านั้นหลังจากทำการรีเฟรชบัตร

# student_record_changed
source: Student record updated.
th: บันทึกข้อมูลนักเรียนถูกปรับปรุงแล้ว

source: Class
th: ชั้นเรียน

# class_option
source: Select class
th: เลือกระดับชั้น"

source: All classes
th: ทุกระดับชั้น

source: Remove image
th: ลบรูป

# remove_image_heading
source: Do you really want to delete this image?
th: คุณต้องการลบรูปนี้ใช่หรือไม่?

source: Yes
th: ใช่

source: No
th: ไม่

source: Delete
th: ลบ

# delete_student
source: Do you really want to delete this student?
th: คุณต้องการลบนักเรียนนี้ใช่หรือไม่?

# image_removed
source: The image has been removed.
th: รูปถูกลบออกแล้ว

source: OK
th: โอเค

# invitations
source: Download for Invitations
th: ดาวน์โหลดสำหรับเชิญเชิญ

# include_all_students
source: Include all students (with photos)
th: รวมนักเรียนทั้งหมด (พร้อมรูปภาพ)

source: Download PDF
th: ดาวน์โหลด PDF

source: Invalid OTP
th: OTP ไม่ถูกต้อง

source: OTP Sent
th: OTP ถูกส่งแล้ว

# one_time_password
source: One-Time-Passwort (OTP)
th: รหัสผ่านชั่วคราว (OTP)"

source: Enter code
th: ใส่รหัส

source: Confirm
th: ยืนยัน

source: Resend
th: ส่งอีกครั้ง

source: Edit
th: แก้ไข

# no_student_found
source: No student(s) could be found.
th: ไม่พบนักเรียน

# search_students
source: Search for students
th: ค้นหานักเรียน

# search_by_birth
source: Search by Date of Birth
th: ค้นหาตามวันเกิด

source: Search
th: ค้นหา

# no_school
source: No school Assigned.
th: ไม่มีโรงเรียนที่กำหนด

source: Student Record
th: บันทึกข้อมูลนักเรียน

source: Validity
th: ความถูกต้อง

source: E-Mail Address
th: ที่อยู่อีเมล

source: Send ID
th: ส่งบัตร

# email_sent
source: Email has been sent
th: Eอีเมลถูกส่งแล้ว

source: Enter email address
th: ป้อนที่อยู่อีเมล

# no_picture
source: No image available
th: ไม่มีรูปภาพ

source: Access Code
th: รหัสการเข้าถึง

# show_qr_code
source: Display QR Code
th: แสดงรหัส QR

# digital_student
source: Digital Student ID for
th: บัตรนักเรียนดิจิทัลสำหรับ

source: Class / Group
th: ชั้นเรียน / กลุ่ม

# student_info
source: Receive your official digital student ID card from your school now. You can use the student ID card.
th: ได้รับบัตรนักเรียนดิจิทัลทางการจากโรงเรียนของคุณเดี๋ยวนี้ คุณสามารถใช้บัตรนักเรียนได้

# qr_info
source: Simply scan the QR code with your smartphone and receive your digital student ID card now.
th: แค่สแกน QR-Code ด้วยสมาร์ทโฟนของคุณ และรับบัตรนักเรียนดิจิทัลได้ทันที

# alternativ
source: alternative
th: ทางเลือก

# alternativ_info
source: then enter your personal access code
th: จากนั้นให้ป้อนรหัสเข้าใช้ส่วนตัวของคุณ

# process
source: Information about the process
th: ข้อมูลเกี่ยวกับกระบวนการ

# process_info
source: You must first enter your date of birth. Then you will proceed to the student ID photo upload.
th: คุณต้องป้อนวันเกิดของคุณก่อน จากนั้นคุณจะไปยังการอัปโหลดรูปบัตรนักเรียน

# download_print
source: Download Print PDF
th: ดาวน์โหลดไฟล์ PDF เพื่อพิมพ์

source: Barcode
th: บาร์โค้ด

# barcode_label
source: Instead of QR-Verify, use the library or canteen number as Barcode128.
th: แทน QR-Verify ใช้หมายเลขห้องสมุดหรือหมายเลขโรงอาหารเป็นบาร์โค้ด 128

# administration_id
source: School Administration ID
th: รหัสการบริหารโรงเรียน

# administration_label
source: Unique student ID from your school administration system.
th: รหัสนักเรียนที่ไม่ซ้ำจากระบบบริหารโรงเรียนของคุณ

source: Address
th: ที่อยู่

source: Student added
th: นักเรียนถูกเพิ่มเข้าสู่ระบบแล้ว

# no_push
source: Device information is incomplete. No push has been triggered.
th: ข้อมูลอุปกรณ์ไม่สมบูรณ์ ไม่มีการส่งการแจ้งเตือน

source: Change
th: เปลี่ยน

source: Add student
th: เพิ่มนักเรียน

source: Username
th: ชื่อผู้ใช้

source: Add
th: เพิ่ม

source: Record
th: บันทึก

# admin_school_label
source: Please select school
th: Zwischen den Ausweisen auswählen

# admin_school_btn
source: Save
th: Speichern

# rcorrection_ignore
source: Ignore
th: Ignorieren

# rcorrection_heading
source: Correction notes from your students
th: Korrekturhinweise Ihrer SchülerInnen

# rcorrection_subheading
source: Please also incorporate the corrections you accepted into your school management software so that they are included in future automated updates. Otherwise, future updates would revert these changes to student IDs.
th: Bitte übernehmen Sie die von Ihnen akzeptierten Korrekturen ebenfalls in Ihre Schulverwaltungs-Software, damit diese in zukünftigen automatisierten Updates ebenfalls enthalten sind. Andernfalls würden zukünftige Updates diese Änderungen an den Schülerausweisen wieder rückgängig machen.
